#pragma once

// Darwin Project (open_beta_2) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "DW_DarwinEnvironmentManagerBP_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// BlueprintGeneratedClass DarwinEnvironmentManagerBP.DarwinEnvironmentManagerBP_C
// 0x02A4 (0x07DC - 0x0538)
class ADarwinEnvironmentManagerBP_C : public ADarwinEnvironmentManager
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0538(0x0008) (Transient, DuplicateTransient)
	class UDarwinEnvironmentNoonProfileBP_03b_C*       DarwinEnvironmentNoonProfileBP_03b;                       // 0x0540(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentSunsetProfileBP_09_C*      DarwinEnvironmentSunsetProfileBP_09;                      // 0x0548(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentSunsetProfileBP_08_C*      DarwinEnvironmentSunsetProfileBP_08;                      // 0x0550(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentSunsetProfileBP_07_C*      DarwinEnvironmentSunsetProfileBP_07;                      // 0x0558(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentSunsetProfileBP_06_C*      DarwinEnvironmentSunsetProfileBP_06;                      // 0x0560(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentSunsetProfileBP_05_C*      DarwinEnvironmentSunsetProfileBP_05;                      // 0x0568(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentSunsetProfileBP_04_C*      DarwinEnvironmentSunsetProfileBP_04;                      // 0x0570(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentSunsetProfileBP_10_C*      DarwinEnvironmentSunsetProfileBP_11;                      // 0x0578(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentNoonProfileBP_09_C*        DarwinEnvironmentNoonProfileBP_09;                        // 0x0580(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentNoonProfileBP_08_C*        DarwinEnvironmentNoonProfileBP_08;                        // 0x0588(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentNoonProfileBP_07_C*        DarwinEnvironmentNoonProfileBP_07;                        // 0x0590(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentNoonProfileBP_06_C*        DarwinEnvironmentNoonProfileBP_06;                        // 0x0598(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentNoonProfileBP_05_C*        DarwinEnvironmentNoonProfileBP_05;                        // 0x05A0(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentNoonProfileBP_04_C*        DarwinEnvironmentNoonProfileBP_04;                        // 0x05A8(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentNoonProfileBP_10_C*        DarwinEnvironmentNoonProfileBP_11;                        // 0x05B0(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentNightProfileBP_09_C*       DarwinEnvironmentNightProfileBP_09;                       // 0x05B8(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentNightProfileBP_08_C*       DarwinEnvironmentNightProfileBP_08;                       // 0x05C0(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentNightProfileBP_07_C*       DarwinEnvironmentNightProfileBP_07;                       // 0x05C8(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentNightProfileBP_06_C*       DarwinEnvironmentNightProfileBP_06;                       // 0x05D0(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentNightProfileBP_05_C*       DarwinEnvironmentNightProfileBP_05;                       // 0x05D8(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentNightProfileBP_04_C*       DarwinEnvironmentNightProfileBP_04;                       // 0x05E0(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentNightProfileBP_10_C*       DarwinEnvironmentNightProfileBP_11;                       // 0x05E8(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentMorningProfileBP_09_C*     DarwinEnvironmentMorningProfileBP_09;                     // 0x05F0(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentMorningProfileBP_08_C*     DarwinEnvironmentMorningProfileBP_08;                     // 0x05F8(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentMorningProfileBP_07_C*     DarwinEnvironmentMorningProfileBP_07;                     // 0x0600(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentMorningProfileBP_06_C*     DarwinEnvironmentMorningProfileBP_06;                     // 0x0608(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentMorningProfileBP_05_C*     DarwinEnvironmentMorningProfileBP_05;                     // 0x0610(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentMorningProfileBP_04_C*     DarwinEnvironmentMorningProfileBP_04;                     // 0x0618(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentMorningProfileBP_10_C*     DarwinEnvironmentMorningProfileBP_11;                     // 0x0620(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentMorningProfileBP_03_C*     DarwinEnvironmentMorningProfileBP_03;                     // 0x0628(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentNightProfileBP_03_C*       DarwinEnvironmentNightProfileBP_03;                       // 0x0630(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentSunsetProfileBP_03_C*      DarwinEnvironmentSunsetProfileBP_03;                      // 0x0638(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentNoonProfileBP_03_C*        DarwinEnvironmentNoonProfileBP_03;                        // 0x0640(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentMorningProfileBP_02_C*     DarwinEnvironmentMorningProfileBP_02;                     // 0x0648(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentNightProfileBP_02_C*       DarwinEnvironmentNightProfileBP_02;                       // 0x0650(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentSunsetProfileBP_02_C*      DarwinEnvironmentSunsetProfileBP_02;                      // 0x0658(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentNoonProfileBP_02_C*        DarwinEnvironmentNoonProfileBP_02;                        // 0x0660(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentMorningProfileBP_01_C*     DarwinEnvironmentMorningProfileBP_01;                     // 0x0668(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentNightProfileBP_01_C*       DarwinEnvironmentNightProfileBP_01;                       // 0x0670(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentSunsetProfileBP_01_C*      DarwinEnvironmentSunsetProfileBP_01;                      // 0x0678(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentNoonProfileBP_01_C*        DarwinEnvironmentNoonProfileBP_01;                        // 0x0680(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentMorningProfileBP_C*        DarwinEnvironmentMorningProfileBP;                        // 0x0688(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentNightProfileBP_C*          DarwinEnvironmentNightProfileBP;                          // 0x0690(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentSunsetProfileBP_C*         DarwinEnvironmentSunsetProfileBP;                         // 0x0698(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentNoonProfileBP_C*           DarwinEnvironmentNoonProfileBP;                           // 0x06A0(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class USceneComponent*                             DefaultSceneRoot;                                         // 0x06A8(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class ABP_Sky_Sphere_C*                            SkySphere;                                                // 0x06B0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class UDarwinEnvironmentNoonProfileBP_C*           NoonProfile;                                              // 0x06B8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentMorningProfileBP_C*        MorningProfile;                                           // 0x06C0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentSunsetProfileBP_C*         SunsetProfile;                                            // 0x06C8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UDarwinEnvironmentNightProfileBP_C*          NightProfile;                                             // 0x06D0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              CurrentTimeInPeriod;                                      // 0x06D8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Morning;                                                  // 0x06DC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Noon;                                                     // 0x06E0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Sunset;                                                   // 0x06E4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Midnight;                                                 // 0x06E8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               DebugMessage;                                             // 0x06EC(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x06ED(0x0003) MISSED OFFSET
	struct FString                                     CurrentDayPeriod;                                         // 0x06F0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int                                                CurrentDayPeriodIndex;                                    // 0x0700(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0704(0x0004) MISSED OFFSET
	TArray<class UParticleSystemComponent*>            Clouds;                                                   // 0x0708(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UParticleSystemComponent*>            Lightnings;                                               // 0x0718(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                              CloudsDistance;                                           // 0x0728(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                NumberOfCloudsPerRow;                                     // 0x072C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              NextLightningTime;                                        // 0x0730(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              LightingDeltaTime;                                        // 0x0734(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxTimeBetweenLightning;                                  // 0x0738(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FogHeightMin;                                             // 0x073C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FogHeightMax;                                             // 0x0740(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FogDesaturationMax;                                       // 0x0744(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SnowFullTime;                                             // 0x0748(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x074C(0x0004) MISSED OFFSET
	class ADarwinParticleManagerBP_C*                  AllParticleSystems;                                       // 0x0750(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	bool                                               StormCleared;                                             // 0x0758(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x7];                                       // 0x0759(0x0007) MISSED OFFSET
	TArray<class AStaticMeshActor*>                    AuroraSM;                                                 // 0x0760(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class APointLight*>                         AuroraLights;                                             // 0x0770(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class APointLight*>                         AmbianceLights;                                           // 0x0780(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	float                                              BirdsMinSpawnTime;                                        // 0x0790(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BirdsMaxSpawnTime;                                        // 0x0794(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              NextBirdTime;                                             // 0x0798(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               NoFog;                                                    // 0x079C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x079D(0x0003) MISSED OFFSET
	class UHierarchicalInstancedStaticMeshComponent*   InstancedLogs;                                            // 0x07A0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                CurrentGraphicSettings;                                   // 0x07A8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0x4];                                       // 0x07AC(0x0004) MISSED OFFSET
	class APostProcessVolume*                          PostProcessVolume;                                        // 0x07B0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData)
	class UMaterialInstanceDynamic*                    PostProcessLUT;                                           // 0x07B8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UMaterialInstanceDynamic*                    PostProcessSmokeOUT;                                      // 0x07C0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                SunsetProfileIndex;                                       // 0x07C8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NightProfileIndex;                                        // 0x07CC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                SunriseProfileIndex;                                      // 0x07D0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NoonProfileIndex;                                         // 0x07D4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ProfilesCount;                                            // 0x07D8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("BlueprintGeneratedClass DarwinEnvironmentManagerBP.DarwinEnvironmentManagerBP_C");
		return ptr;
	}


	void ClampProfileIndexes();
	void UpdateStormIntensityForPlayers(float NewIntensity);
	void AdaptDayTimeRange();
	void AdaptDayTimePermilRange();
	void InitBPReferences();
	void Tick(float DeltaTime, bool SpawnBirds);
	void CheckAndInitSceneBPRef();
	void SpawnBirds(float DeltaTime);
	void UpdateAmbianceLights();
	void UpdateAurora();
	void UpdatePostProcessSettings();
	void IsSomethingInvalid(bool* SomethingInvalid);
	void LaunchStorm();
	void DestroyAllStormParticles();
	void CreateLightningRow(int A);
	void CreateCloudsRow(int A);
	void UpdateEpicStorm(float DeltaTime);
	void UpdateFog(class UDarwinEnvironmentProfile* BeginningProfile, class UDarwinEnvironmentProfile* EndingProfile);
	void UpdateSunAndMoon(class UDarwinEnvironmentProfile* BeginningProfile, class UDarwinEnvironmentProfile* EndingProfile);
	void UpdateAtmosphere(class UDarwinEnvironmentProfile* BeginningProfile, class UDarwinEnvironmentProfile* EndingProfile);
	void DebugDayTime(const struct FString& Message, bool Error);
	void UpdateLight(const struct FLinearColor& BeginningColor, const struct FLinearColor& EndingColor, float BeginningIntensity, float EndingIntensity, class ULightComponent* Light, bool EarthLimit);
	void InitializeNullPointers();
	void UpdateEnvironment(class UDarwinEnvironmentProfile* BeginningProfile, class UDarwinEnvironmentProfile* EndingProfile);
	void UpdateSkySphere();
	void UserConstructionScript();
	void EventResetEnvironment();
	void EnvironmentTick(float* DeltaTime);
	void ReceiveBeginPlay();
	void EventUpdateAllParticlesSunColor(struct FLinearColor* Color);
	void EventUpdateAllParticlesStormIntensity(float* Intensity);
	void EventUpdateAllParticlesFogColor(struct FLinearColor* Color);
	void EventUpdateSkySphere(float* sun_brightness, float* clouds_opacity, float* stars_brightness);
	void EventUpdateAllParticlesSunDirection(struct FVector* Direction);
	void ExecuteUbergraph_DarwinEnvironmentManagerBP(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
