#pragma once

// Darwin Project (open_beta_2) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "DW_HuntressNewGuyABP_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass HuntressNewGuyABP.HuntressNewGuyABP_C
// 0xC274 (0xC734 - 0x04C0)
class UHuntressNewGuyABP_C : public UDarwinCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x04C0(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_706180DE46F7E32DB0DBEE8D6CC585A0;      // 0x04C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E2EAD9CE4B94EF2BFD5E49A130881778;// 0x0510(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_96405E304984CB021456119FEB0B0A61;// 0x0590(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_34460373486B75290FBF1495CC79D47C;// 0x0610(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2C9658FE45C39B686EF0DAA3478D3DB3;// 0x0690(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7D58A6474C1C4C0A60C7BB9E1ADD3A96;// 0x0700(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EFB3E18C48CE56F1443A0BB443C7EAAB;// 0x0748(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C35D07144D7033251B5982BF5BBEB1D9;// 0x07B8(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F3C351E744072B98D97669990B0A9044;// 0x0828(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_31EA3D654C7F38C1AA2DD19A212169E5;// 0x08F8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4647D2604A4435368B12EF8E56C24CF8;// 0x0940(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CEFB2A89421CE498468816876AEF8717;// 0x09C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A9610C334D4A42BBD06D1CA0D5FE6060;// 0x0A40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A950DD7B45C8325601E2848ACD0BF5AF;// 0x0AC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_89CCB82149DC2B73EB88749214E6D3D9;// 0x0B40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1D1CEE934587763DE7C95EB2FEC7AFAC;// 0x0BC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_874519714CFA8A07566278AC0B4C4525;// 0x0C40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_ECFDB8AD4AB49E879AAE0995F6A32504;// 0x0CC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DE6BE15B415A1BBC0FDC4DA842072BF3;// 0x0D40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BA3C63AF499CD5E69CDC4598F479DB2E;// 0x0DC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AB2E2C564E44EFBF4FDB9B896D915C76;// 0x0E40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F8297A4347845247F8565993FC1A4C44;// 0x0EC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_29BEDC654A07ABDDF1535E89957E092E;// 0x0F40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C98FECD94DF999E9D98F77BA9619ED0A;// 0x0FC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0E15E9FF49152F52693F6991A1D316C6;// 0x1040(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_265D5F04430F4893BA3EC29D1B537590;// 0x10C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FE0565B540B6F4007656FDBC5BFDCCE4;// 0x1140(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6DFA400845583E5CE25A099A7651234D;// 0x11C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2B462B7B4D36275A6886C2ABA8F0C7C1;// 0x1240(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_135E95EB484C18BB7FAD2DB02E091709;// 0x12C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F040F3D4F0C8F827B49F7AE957A603D;// 0x1340(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_52FFD9A941A4FFB9B8F4CEB2C85B7E32;// 0x13C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_10F52530464DB80DBF635CA29DEE2A2A;// 0x1440(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B1DBDF16469D8EDDC98F29A04395F33A;// 0x14C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F4C51B5B48921CC81D9C4883ECB43751;// 0x1540(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4E429CE44687699C37D34CB249DB49BA;// 0x15C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_585D84F24E98D1A7FF0A9FB81410F713;// 0x1640(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DDCA850A405D598946A5CA9BC73FB793;// 0x16C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6E2BB1044B7A048EA5205285F0DA3E2E;// 0x1740(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9362420648CB2B6D55B96FBD3310A162;// 0x17C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CFA2F6CB44C54B71BFE9C9A60FEA9988;// 0x1840(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A6CE24D04AD89A0D813F81A324B0254D;// 0x18C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CDD773D349604CC559F6E2939F685C39;// 0x1940(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2607F0A1422FB89AD6E7D799F4D30FC7;// 0x19C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7A2FF9344D44B3F86769ECA8E7F28099;// 0x1A40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7313B9104594EDC6EE5838AB1863F350;// 0x1AC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_73382F264BEBB93735E349965A5C8EC9;// 0x1B40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F244B364D924E8AB4F709BEFFF16E9A;// 0x1BC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0533BC4445E3A3DD893EA0A77596342E;// 0x1C40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_18B0EE0B43689AB55A74D28AB9A2D1A0;// 0x1CC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C2DC708949A11D5087D44FA21605A9E3;// 0x1D40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_60359B66466079BF6F80F08EE797099D;// 0x1DC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E9F4965F491F0E9836FF29BFF9BE8439;// 0x1E40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_33C0CC1C48E2656B14D24AA8CC6468C8;// 0x1EC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C6C76B76490792702BC44BAC25578000;// 0x1F40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F5595F1D4BE687B07305FCABE73865B6;// 0x1FC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3EF523844E6C9D62E50AE8AE6446425A;// 0x2040(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7338C5684F81ADA2B9E916A0D3DC9561;// 0x20C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6EF6DE504250DBBB119B7FA4F0DAF969;// 0x2140(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3915A03140AD17E4397D21BF4F7971D0;// 0x21C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7B19EACD49C63A2BBF62EB8596F063AD;// 0x2240(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C2E0F6274ECB80CC4EC452A6FC75BB8F;// 0x22C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EAE4A98B462ED78A0375479EF586D2A5;// 0x2340(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CAF11F2C44601AA9B875FDAE8E4F0F3A;// 0x23C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9CAA5C884E692452542E27B2F0600E52;// 0x2440(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_50434D034F87093DFE7668884AAD0EA9;// 0x24C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D3F833604B16DF9D5F234893F6D1060C;// 0x2540(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F374113D4AB9D99C273211AB1F57D1B8;// 0x25C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CE5D8D6D401E1AEF45D0ACADD098DD0B;// 0x2640(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EFBA6DDC4E5C26C556465BBDF6BA6A3E;// 0x26C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_46BCC55E48B2FF9ECF84F7835F4886D2;// 0x2740(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9F21326A4934FCB8F2E2DD9F67AE2351;// 0x27C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1ABDE5184D006BB884F67993C4935A43;// 0x2840(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C6983C8941E41BB45657C7BA4EBEEF37;// 0x28C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C969A4D84F1370375506F19702193D53;// 0x2940(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_727A7BC0453D08E05E1A9BB84B887C2A;// 0x29C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0BAAB15C4E48351F31563CAA6448169F;// 0x2A40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9D77D2A640DD03778DCD52BB8F090EC1;// 0x2AC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_05DB5F4E4099E75E8689E2AE4FF7B64A;// 0x2B40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E205B97C4CA32B8CBFC6009370B8A965;// 0x2BC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_74B430BE4567CB8AFCA8FE8121C5D17D;// 0x2C40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4FFDD5134AC7F1DF43CB9C9486A1312F;// 0x2CC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8909AB8D4A19B9902478B5BF86FCDC0C;// 0x2D40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C0D1D90E41BC5F37756853B3D0040565;// 0x2DC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_445F9DC2455E1212B8E447A94FBBD530;// 0x2E40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D621B87246F8DE23758B4E8736A7656E;// 0x2EC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A094B65645FEC3F6891BB7A0C306E97F;// 0x2F40(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_41638D95490281A7DAE154AC5553223F;// 0x2FC0(0x0070)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_8598635E40AE0AB19B835B9FDFD4A557;// 0x3030(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_91668865422E5FD2FAF511B830454E52;// 0x3110(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_09C102AF4A76DE5A687F97988336FF62;// 0x3180(0x0070)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_ACE4C14345102EE237CB7A9652E2E536;// 0x31F0(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D10EFBC74BDD8052417B7899BDA5E772;// 0x32D0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C3F0BF0E494B0E1B336C808608570D36;// 0x3340(0x0070)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_6ACF3064494EB51C753642B515BFAF67;// 0x33B0(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D9CC00464B2E7714E5F3ABA8003EE014;// 0x3490(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EED1683E4E55762576ECF591F9B26A21;// 0x3500(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4D2203B0448ED3ACAEB83C98946962BD;// 0x3570(0x0070)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_C2C597CF432B7077C361CDB5424A1EA3;// 0x35E0(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_728F12D540BF9F37B044089AAEF73C94;// 0x36C0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CF6B9A734AA29449050947BBB73B0FFE;// 0x3730(0x0070)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_5BE88C7D45FB5D33069ACBB8C1F058EF;// 0x37A0(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1F7DBF7C42B242563B9E0DA1AD35B61B;// 0x3880(0x0070)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_198F091A4FF8970ED8E513AFB6A42B44;// 0x38F0(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8192E4C040528517EAD959989799F5BF;// 0x39C0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_0CEAEFF64363E2D3F5A90680B1CBEA41;// 0x3A08(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8E099F8E4276BF2D92E3279AC59969DD;// 0x3B30(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3FA9556E4D16581CE7398B92C542FAF3;// 0x3B78(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4E3F87AE47C7D93E35C22EBDC568B6DF;// 0x3BE8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_093EBC114081B7A8AA97D3BE7FEC90A0;// 0x3C30(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_875D583149228C0BD281E481771209C6;// 0x3CA0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_18ADC750483C2E1321347096580D0DEC;// 0x3CE8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4081AAF54A555E7FBE198C8B23C8E7B2;// 0x3D58(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_88A0C4A04B9A94AC83BBA69A874803CB;// 0x3DA0(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_EFB00BDC4F6F5DF50E3CFAA2FB5B113C;// 0x3EC8(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_EB5F4D9B4A02194C0DA988B128E8351D;// 0x3F10(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_ED2A73B14769F062495A42A2ACAD850D;// 0x4038(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_454F526E49AB18D329EA0D94B09D3683;// 0x4080(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F19E0D07434E21024F506FB57A8F0092;// 0x41A8(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_ECD1EB7A41903DEF0458D38D25F2E51A;// 0x41F0(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_16364A2B407E5ED58A2F6B935BAD6763;// 0x4318(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F925ADAE4FFC33766C40D48B868D3A9E;// 0x4360(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_663DA23540269C45E80470A820C481DB;// 0x4488(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7C8766AC4021F287F6FDD689F4BA8FDB;// 0x44D0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_FC6D53AB40E4B31B8709E0AA0317BD5B;// 0x4540(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_70C2A1C142A0F66799DE81ACAB603A7A;// 0x4588(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3DF5DF47457764DAAF32CBB7B6AAEC7E;// 0x45F8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_801B85754FB4E6FC9591B2929B460DB6;// 0x4640(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4203E87A4A55135A4AEB57A1A611294A;// 0x46C0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2C86A2B24E4AF244CED8D08CA1BE427A;// 0x4730(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_26F0E4024BF67D8DAA0D4BA9AE8D099E;// 0x4778(0x0070)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_70A264344B8744C9DB8A759B3851B828;// 0x47E8(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6E5BC5144FF29CC62CF2318FCE66C7EB;// 0x4910(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_AC9D471D4D760F1C1CA7D185A27C01E8;// 0x49E0(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F0F98CC04CF7A0BCB972CDB413091408;// 0x4B08(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2A48FA1347086E29C8DEB589E32ECF52;// 0x4C30(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_3D4759BA4752D6F9DE9720A877E15214;// 0x4D00(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6062D0C84D9C27E21D1AD8B71F9A1CF3;// 0x4E28(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_8E814C944E122F420A37B29D0E325BE7;// 0x4EF8(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B2C98E3A46B6BC9705C03D8D995B9CFB;// 0x5020(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2D79626242B929777AF693841450AA81;// 0x50F0(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_45F040B340358BD6B1155192EE54B628;// 0x51C0(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_D29258624762AC1A3B8CE1BDB2119BC5;// 0x5290(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_56158E544D5A47F18B3D3DBFED06A69C;// 0x53B8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9115A5B14E84449A084E5F99C32A7895;// 0x5400(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E9BC36F04ECC52F366C4808DD9758173;// 0x5470(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_D02322F64CE6A1D0B04F4196E350D493;// 0x54B8(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5E45099345A40EEC31D8C1A000BD4038;// 0x55E0(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_84F793124413EB6130D4B696828AD688;// 0x56B0(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DE1D0CF34100C81449753DBDC0949BD9;// 0x57D8(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E3D070174FE37D20EA99C98025640CCC;// 0x5820(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_42DF82994D92D7E0BDDB0F9BDC7B4BAA;// 0x58F0(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2E9B3269408D73167528ABAA6D09FD5B;// 0x59C0(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_01592E36469CF37F7285478B9FDF4532;// 0x5A90(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_793ED13D4A1A727707583496278CE428;// 0x5B60(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_97BE92304DE18B0632279DBFE42CA809;// 0x5C88(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_BC3197D34255EE0291BF9CBA347D7F20;// 0x5D58(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_54264AFC4E66CDC880A968822E85E1CD;// 0x5E80(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_EFC63DAE450FDC3031C6A5B2A7FED758;// 0x5F50(0x0128)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7B4AD83F485083068EAE85AF2A2325B3;// 0x6078(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EC80DC34484E881530003B99ABFD917E;// 0x60E8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8D0721084220BD2E0509F0A73D251854;// 0x6158(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F21CA5DB45FE4D5F4B99AF9017AD4DE0;// 0x61C8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_146D89C94B4009171F36D6ADC6E37502;// 0x6238(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_71A424E5474A0F908B5067A71B58788D;// 0x6280(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_15B8C364465734F72D2B8A8D47C31BD6;// 0x63A8(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_EBBFDA7943502CE9CB590FB4CB4BF7AF;// 0x64D0(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_204EB2A3429978EC2863228B2D5BF869;// 0x65A0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D5C434B4412B0B28848A6E8EF3767214;// 0x65E8(0x0070)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7D2BCC6E4FA3E06ADEDCA99E951BC8A7;// 0x6658(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_620819F545D8364649047096291A713F;// 0x6780(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_8ECDA8F64D88FA64691A9A8C9D8D9AC9;// 0x68A8(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D540079D421E4FDD7E2B30A56A4E8B3B;// 0x6978(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_00F0BDDC4CB0CE2280222CB6A447D00C;// 0x6A48(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_058377054A244B7AEA49118EA5D978CE;// 0x6A90(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_332EAF2F48096F291C5395BF4A4D5061;// 0x6B00(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0E4CA0F5410CACD4105955AB4892DA15;// 0x6B70(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DD486EED43BA2F26307D2E85AA6380F6;// 0x6C40(0x0048)
	unsigned char                                      UnknownData00[0x8];                                       // 0x6C88(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_31C74778442A12F67E2D8FB4238A6CAC;// 0x6C90(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F8611FDF4342BE34CB0C24A65BCA0591;// 0x6D10(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FF98BEB54C33380F5D5DDB8874FC7D7D;// 0x6D90(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6CBFBF68418C6501ED64A6BCAAFE0942;// 0x6E10(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FD0BCEBD432D2F6BFED438ADC1BC4019;// 0x6E90(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E12754CE440DB245C9B5EE9F0E2DD358;// 0x6F10(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_15735CDC41A78EE9B1CD1393191F5D66;// 0x6F90(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6A7CEAF9415B870636FFD8834A3249F6;// 0x7010(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C25602B0402D8E6047D5E58C7613A527;// 0x7090(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_23CDD8E345B74F8C2A6B11A6D4D1281E;// 0x7110(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AB655F0C46C8B79A761E30B50760DF88;// 0x7190(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1728746140E14AAFEE31919E792ED8DF;// 0x7210(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5251F7A94174E4878DB772BAA076418D;// 0x7290(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5392ED444FC7313E81C5C19366642951;// 0x7310(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_32E0E4464F092C016833729FB7D6727C;// 0x7390(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_01F097734428685164714CBAE33574D8;// 0x7410(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_06E173BF441048060C2C359C854EFFF8;// 0x7490(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D5C8A48A4F39D1937E8D1C96510703B1;// 0x7510(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_93ADEB5A413A2A9075C03CB7C479F275;// 0x7590(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0EFBA09440CC10692AE34983F3D12009;// 0x7610(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B707D1634BA691C02E4B9A92112987E5;// 0x7690(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A4DA391040BCE3F7E00D948F0298A6C5;// 0x7710(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FA67EA8F4DA992F2DB98CC80F9CAA86F;// 0x7790(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_21043D004780AEC2EF65B0945AD3C650;// 0x7810(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6C17B18C442409C1F08698A56DC11A6C;// 0x7890(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A26A35DE410926632F1EDEBBD3ABD84A;// 0x7910(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4B17F0B54BD2E952F290EC89765E135B;// 0x7990(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E3E9A6A4450777A5AC341BB06F9FC480;// 0x7A10(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0AC879994A3D5EB218A38F888260D76B;// 0x7A90(0x0080)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_196521E345B4917EDB1D00998B229374;// 0x7B10(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B8C3B4DA4E2A1941452C2D8699956F0E;// 0x7B58(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_18A1896A4DB52E808BE5ACB38F81BF25;// 0x7C80(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_08B1366244D7E2D1A2356CA902E3B52B;// 0x7CC8(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E4DE8AA14009C4DB916F3A88DBACD204;// 0x7DF0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_CC8FD48E4952E0BE0EEA9F92965AA6A4;// 0x7E38(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5ABD93CC4736E6951D5BA2B3D5A2D961;// 0x7F60(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_0A7ECD504814B59F9F49BBADABEFD35D;// 0x7FA8(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9A6E2BB140E3E044215D86A4FE73FF56;// 0x80D0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_41FC1C6A4321A82F89F555BA007A512F;// 0x8118(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_224AFB994B1A18152DE195AD8435471C;// 0x8188(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8244B64A4C7AEFB73682ABBB5E2AA94F;// 0x81F8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DA6F096347BCA5D3D59DFDA8D2D32864;// 0x8268(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B117D4BF443C5A86C77930A82FCD1A28;// 0x82D8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BB50ECAC452DADCE045447B970730606;// 0x8348(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_429B0A3247DFAB4B0610E9A614B74C84;// 0x83B8(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C3808E8540A83B281926CBB95649EA54;// 0x8488(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C93DBAB2435320E42754588C39435B20;// 0x8558(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_AC61F2F84451937E9680538E53F94AB9;// 0x8628(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_49A225D34D72F7E29ECD04A075990A4B;// 0x86F8(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_735FFDEB41FDF8E9350D9F845E65D6B3;// 0x87C8(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_0CF85018465926720E54F280D4B2B328;// 0x8810(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E24AD4C04523C78752E106B2A43E8ECC;// 0x8938(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B286C4E1457297DEA368D39FAEAED663;// 0x8980(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3B43DE614982B223AF404AB4168DF228;// 0x8AA8(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_E018827B4518E22BB929609519A997E9;// 0x8AF0(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4F3C03424A2A008898D074B206F5DB97;// 0x8C18(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_2C231593489DC9CBE4AEC9A327663ED4;// 0x8C60(0x00D8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_42CD5EA94A137AA02819B9A2995429EE;// 0x8D38(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8A16070E49606C00A821F3B5EB3EA509;// 0x8D80(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BCC43C9E43BF24537D5A81AAE9B84ACF;// 0x8DF0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_66C37D444E280D62D54B47B024C1C9BD;// 0x8E38(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BB402287449D96BF0879FFBCBEF1E423;// 0x8EA8(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5ECEDA2E46695CF674A083A42E8325A8;// 0x8F18(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_393AECA841B172C22B3F71BD40A15C36;// 0x8FE8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FBAD7BED45A277C808AAE7A9BD8738B2;// 0x9030(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_69095AB346707D4CDC1B2CA213385D11;// 0x90A0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_87A7100D4016A538330B578C0D8B5B98;// 0x90E8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F7F0B6084E332781982D4084CB0510A7;// 0x9158(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_247560B449D7E621611E58BCD8917316;// 0x91A0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D6FAFF8A4DAE78428CF0F89AF31148B1;// 0x9210(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7AD39C6F48DB56A7ED9C71909D9F2327;// 0x9258(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8157848D4CA5545E2B2A32A3E94422B3;// 0x92C8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F0014C3343F2D0F02310A1B97D2D8462;// 0x9338(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9A7A9D294B4A1B0D5D2EE895C64BAE05;// 0x93A8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C00F5ACA464182E1A0A9C1A538BA0439;// 0x9418(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_925CB6C44D0D7651B1653F80832B4827;// 0x9488(0x0070)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_2B7B13A24C0A64283C9610A473D5C062;// 0x94F8(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B85931814582E9EF9A0D3D9288F30A8E;// 0x95C8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A9BE51444994D104DCAC8CB68ECA6561;// 0x9610(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7D1F9A1E4F4CA0F7309C779F36218EDC;// 0x9680(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D86D5021419529E43F1196BC21405365;// 0x96C8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D9FC122A4A366EFADDF340AB389EFE88;// 0x9738(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_73CB7BE342B23F7EFD4430929D8B5F3C;// 0x9780(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_60E0C4DF4FDC0DD50A01778B16C8AC74;// 0x9850(0x0128)
	unsigned char                                      UnknownData01[0x8];                                       // 0x9978(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_906026444CDA4C46F8582DB4DFAD3A08;// 0x9980(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8AB56419402788E9A973A6BAD64C8456;// 0x9A00(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BA0D8F4D4DFF29C22B19768FE362FCB1;// 0x9A80(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2D866A864AB878A2B58BC1A4398A67F0;// 0x9B00(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0319CCF54A5F13586053F7BAC4CF37F1;// 0x9B80(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_270A89D94B92769B3E5D4494549A9443;// 0x9C00(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AD1109AD4A0447B47030F9BA66CE7444;// 0x9C80(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BFC9075E49CBC681B59EA0A4484B7521;// 0x9D00(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E3999AF147D48BEDE490138D35C0FCD1;// 0x9D80(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1E7C26824ED41C83F9A6D8B90B098528;// 0x9E00(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_60CEDF1745D5FEE94036DEBBE7C2F9E6;// 0x9E80(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5F5A2408471FCEF73ED13D9A81AA7409;// 0x9F00(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DB8A84814FED4BADC55F7694D49C458F;// 0x9F80(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EC2F64FD43E65FCB6328C1BC852A28F8;// 0xA000(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DF3684CE4D7A67A7417ECFAC85C36B7D;// 0xA080(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_48972EAA438A239F5CC3A5BAD14C14CE;// 0xA100(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_543A3BE0448DB8B28A1400B635B01D48;// 0xA180(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DDFAA8BF4419F63D350E0EB61BCF1DAB;// 0xA200(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_060A668D4AA64D99009D0EB5C0F1E488;// 0xA280(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C8D5A2794636A620B3D0FEB6188BE292;// 0xA300(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F6D7D70F4B285FF96753338081519FAC;// 0xA380(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2C80E16D4A416E7791C774AB51EEA06D;// 0xA400(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6DEF060244FDD0A2CE38BFB8F3FFEE7E;// 0xA480(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AB42995141FDBBA9ED43DD971CF8EC4B;// 0xA500(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_646B62C0452656C0715EF1BC72BE0849;// 0xA580(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0D99DD7647DFFD44CBC668B509530460;// 0xA600(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5C7E4A464D3203936B98759EEE58EC32;// 0xA680(0x0080)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A0994CA640E2ACF1A51BD3A3C360BFD1;// 0xA700(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_298879FD418DAE88BC3EE6BD24E7B48B;// 0xA748(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2427A39A4FC83D4303587C9804D3D239;// 0xA870(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_735ED0C9495E4B083EA11A82E2C0EEEB;// 0xA8B8(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_098024F847762F7583EF5BAAF1EC3706;// 0xA9E0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_825826454FBE4760DC55ECAF4A136155;// 0xAA28(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C7BD8C774412EC51C5ABECAE3C497B3D;// 0xAB50(0x0128)
	struct FAnimNode_MultiWayBlend                     AnimGraphNode_MultiWayBlend_D3E41EBB4916BCBA4D9816A3B8002C10;// 0xAC78(0x0070)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_5DA1650040B52166E34F57A6BA29D480;// 0xACE8(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_98E5A7A3495FB4F3D1842A9D2EF18F10;// 0xAE10(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A93FB82C4005A119194F2781D94D2D8C;// 0xAE58(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4278B91D4FB20CAFDC69689A122F9C83;// 0xAEC8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_437E81414BA2E5734B0A1F9618E53C13;// 0xAF10(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5CF74CEA43846797F325E6898A749AE1;// 0xAF80(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_92FB472D4EE991017D07F487A82F55F2;// 0xAFC8(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2489D6B34B350EF625DFDD948FD5AD19;// 0xB0F0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_022182D7492E35F7031E3EB64B231628;// 0xB138(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_8CB6FC1345149A213DCE6689609711A7;// 0xB260(0x0128)
	struct FAnimNode_MultiWayBlend                     AnimGraphNode_MultiWayBlend_714A80C64AADC2918E24F29303567C3C;// 0xB388(0x0070)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F9FC32654622700ACB844CACBC0434E3;// 0xB3F8(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_8D63061041E8716812ECD19E4BA71F1B;// 0xB520(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9FFA3F904AC1CF276499279CB011C2D1;// 0xB648(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_6DE82EA2497902110529F0BEC24075E9;// 0xB690(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BF8E24E242231B0AB5E578A88CA090AC;// 0xB7B8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6DD5D6D9499F5EE6131515B86A93BDFF;// 0xB800(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C475BB894BF72E0AD20DDBA3D6CC4D70;// 0xB870(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_1CE499724A14AAA500355A98B4858882;// 0xB940(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_A2C44CD84510131E67129C89232D5C98;// 0xBA68(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_1CFAE4174627493BA8432A9CA5D39F02;// 0xBB90(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_64DCBC46410A4A8838E9088E092CF7C2;// 0xBC60(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_0AAC91104B7FE6EB24B0229A60C5D0F2;// 0xBCA8(0x00D8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D2FD564A40E2D7B6DD477195DBF872A9;// 0xBD80(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_5CEF4B4E48A9FAE55D21978EEFD7DCE4;// 0xBDC8(0x00D8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_271F39074D912613644F4891B255EF80;// 0xBEA0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_466C106F40FF1A853CBA9C924ACCBEC2;// 0xBEE8(0x00D8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_1FD7CDAF47F829E575120B8C8795B281;// 0xBFC0(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D211DE6B484DC579386480BF7049F82F;// 0xC0A0(0x00D0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_1522E32E435120FA2820C18F85717C0A;// 0xC170(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_AD5B17704FE49837C4151DAB0ECB675A;// 0xC218(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E27DA971488909F7F595589562A8E771;// 0xC268(0x0050)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_882E8C86474C1BF5B4AB56AEAB9BCC43;// 0xC2B8(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_49EDEFCF4FB076BA2E6829A1D4F49403;// 0xC3E0(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_EDB116D249BF46119EA0AFA831F67075;// 0xC508(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_FA1B61B84D7B9E842763EE952AFE748E;// 0xC5D8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B473A49F4EE3B192EEA4E7A92754CAEA;// 0xC6A8(0x0070)
	float                                              LeftRightBlendBuffer;                                     // 0xC718(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FidgetStrength;                                           // 0xC71C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              WantedFidgetStrength;                                     // 0xC720(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               ShouldBeInAir;                                            // 0xC724(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               shouldBypassIdle;                                         // 0xC725(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2];                                       // 0xC726(0x0002) MISSED OFFSET
	float                                              AirZBlendBuffer;                                          // 0xC728(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               FromAxeSwing;                                             // 0xC72C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               ShouldBypassJumpThrust;                                   // 0xC72D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsInAimLoop;                                              // 0xC72E(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               JumpLandHappenedInAimLoop;                                // 0xC72F(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                WinnerAnimationIndex;                                     // 0xC730(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass HuntressNewGuyABP.HuntressNewGuyABP_C");
		return ptr;
	}


	void MakeLeftRightBinary(float InLeftRight, float* OutLeftRight);
	void SetShouldBypassIdle(bool shouldBypassIdle, bool* Out);
	void ShouldAxeInteruptGotoAir(bool* ShouldGotoAir);
	void Should180L_tr_idle(bool* should180L);
	void Should180R_tr_idle(bool* Should180R);
	void SetShouldBeInAir(bool ShouldBeInAir, bool* Out);
	void PrintFloat(float In, bool* Out);
	void IsVelocityZero(bool* ZeroVel);
	void ShouldGotoGroundFromLanding(bool* GotoGround);
	void IsGoingBackward(bool* GoingBackward);
	void should180L(bool* should180L);
	void Should180R(bool* Should180R);
	void ControlIsCenter(bool* GoingNowhere);
	void IsGoingForward(bool* GoingForward);
	void SetLeftRightBlendBuffer(float InTRR, bool* OutTrue);
