#pragma once

// Darwin Project (open_beta_2) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "DW_JerichoABP_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass JerichoABP.JerichoABP_C
// 0xA158 (0xA618 - 0x04C0)
class UJerichoABP_C : public UDarwinCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x04C0(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_DEFFCB3E46C0A17F09B83191CE418E8A;      // 0x04C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AE7C42C04487359D19628C81763C545D;// 0x0510(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A6DC57C34022BCFCA3F8C48435D73937;// 0x0590(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5F2AC5F14988BAF9923E4E8F2F07A83D;// 0x0610(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_639106DB45DE72D3C07188AEA086E754;// 0x0680(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_187B81D143CACE8C785657A396A60A33;// 0x06C8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_46670F444A4D0D061F4B09A411209116;// 0x0738(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_27AA08874A7ECCAE40EE6E92806E7789;// 0x07A8(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_59290CEA446C1871F832C49F82F03AEA;// 0x0878(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B25BAC3747B304D9796094A74A95D1CE;// 0x08C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F1A0B30D46ED91279E07B5AC3B59E9B9;// 0x0940(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_547266594D469E432FD98B94BB869EBD;// 0x09C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C34DEC244A13946F5EDBD1B6A91CEEEC;// 0x0A40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F2DE9DE64BBFFE2D09FD3AA6C2B2822D;// 0x0AC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9C8B4F1546FE1723FA2E9AA58E33FD2B;// 0x0B40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C9C0F545436A2EC70882A9BA36C22920;// 0x0BC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C9F4ABFC4D9C84E2053D6D80413E63D8;// 0x0C40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FAE6F6944BC07E59ED92869AE42A811B;// 0x0CC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BD890840462AB8C729532699C0C4BD5C;// 0x0D40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_77FCE9B449BEAD6C67A663982E313743;// 0x0DC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_64CDB3D84825EB73863BC7AC0964B7EC;// 0x0E40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D9767BC14756B033C76D31905947727E;// 0x0EC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_73CB6D0843E5A51D73B745A37864FE73;// 0x0F40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0E88DABB4476835803E2869862FADDA7;// 0x0FC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_47EAEB99448B46880DA0009F4A80D946;// 0x1040(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A14A306E405E76B68295F89A34A71ED7;// 0x10C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0807376C45035C84013FDCA52A128F06;// 0x1140(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7DF12EAB4CBB3877EE268EB207FE9498;// 0x11C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8268C4594BDD3014B319CBB5E2F6AE40;// 0x1240(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E9A5F7BB44A8D80AFF3FC897EEE4534D;// 0x12C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F1A1C8DB4A880E343384A0B039348081;// 0x1340(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_58F513D443D2118E435EA7B6E94AC566;// 0x13C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0CE01CDE4983931EC4ACE580F2C1ECD9;// 0x1440(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_77D75CBE47A65ED4A672549A230C8B12;// 0x14C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_50D613AF403B4FE8DDECDFA8413DB8A1;// 0x1540(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6E6C30B04E77ECF9278301B5E3DF57F1;// 0x15C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3AF46D844DA89338D1BE55A166D9530C;// 0x1640(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_855D086C4DF76CE00F4EEFAAB245125A;// 0x16C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_83BFDFF644118804D0E0D496DC261F12;// 0x1740(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FA60BD724AA49A3A886950937D626030;// 0x17C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0E1D701242E7AFCEF8D45999AFB768BF;// 0x1840(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_086D41E448110D847818E2BDC99158C1;// 0x18C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4747D8064BA1C0130E825F82202BBC3F;// 0x1940(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DB1BA02A45C06B7435C9BA8FCB0614D3;// 0x19C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9A93240D4E22936E9BE1409E9CC0AA25;// 0x1A40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1FE6ABF1493847884F5A6D9389BD8EA6;// 0x1AC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3F84676348C021E85EAA8FA961971282;// 0x1B40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9A7F40D1432AD6D2F0571AA4CE6495AA;// 0x1BC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EE23CC844BB3E65D2501D5B7C856AC59;// 0x1C40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_63380F8D43894327F14FD1B27D4126C8;// 0x1CC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FADDDA3E4A5F13735BAFA68E976A877D;// 0x1D40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A263FCBE4A88AA56DEE969A35702A2C2;// 0x1DC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6D2356AF4321E07D271C1F844D3B6D47;// 0x1E40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D547CC6F400D37181229EFA2D232AF32;// 0x1EC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7C69FEB14815923044B38CAA8F4E7D0C;// 0x1F40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4CE0604B4242DF8B223888A22DF264E1;// 0x1FC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_087CAA1A4AD9A04DDC6A429D6CA1E038;// 0x2040(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E2930B7C47B6686ED7A685A6F54026D1;// 0x20C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F0A81BE64489162EAE42E6A23A311D1B;// 0x2140(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A782AD834EA577833FB41CAA2CE2FD86;// 0x21C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3876E54248B9A9DB0AF580B9F4D61A9F;// 0x2240(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A034E86A4350104507AC458BC559CE41;// 0x22C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_16B0016A48A81D9009CDA7BF0D7D7AA3;// 0x2340(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B48D75654D4F244542F258B80B2BBCDF;// 0x23C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6E64CC6945A7F1105A3B60A38323503D;// 0x2440(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5CC9A2C94FEC1BA0CCBB37AF0F93CB9C;// 0x24C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_185CAE10424595D374DA199B0375CACF;// 0x2540(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2878A4804C7107B30DECC8930481D672;// 0x25C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1FB3D9784CC8C4AD4815AF8E47C775AD;// 0x2640(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E378AF854FF1D7C15BEC1188CF5B1FF2;// 0x26C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D07D854440CB8DDFB6C84383D583D51A;// 0x2740(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E125C6FF478EFEB05CA2438AD39BBBF5;// 0x27C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5D7BABF2479F99341273FDBDF2739252;// 0x2840(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0FF1337F485C904D3F7052A3E08B40DF;// 0x28C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5F895E304835F02A7A88059491D81C87;// 0x2940(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CCCD1E7646D0B497AE19D5AA998088DB;// 0x29C0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5E3577834E5558E656A185BB6811B152;// 0x2A40(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8A15D28D4B3D798BBB38928DCDEEBEE6;// 0x2AC0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_64F862E948ABDE4F2F7F1AB96F660031;// 0x2B40(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BE6FD886491D96237BD0CDB3609F66B1;// 0x2BC0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4A85BD074922E4AA34BC5FBB2AC28CE8;// 0x2C30(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FE02ABA64F52EE9523D85F9CFE1ACD78;// 0x2C78(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7450B4BE4AB10B4F031C10999DE9AA1F;// 0x2CE8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9357A4E74C2DEDCC87F0FE85AFD03826;// 0x2D30(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DFEF7C0246461A3EE6884F9CEE3A049E;// 0x2DA0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_E016DE1E4BF9BEF19511F2B32DBF21A4;// 0x2DE8(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_792450E94ED90D4CA3E6F6880ABA54232;// 0x2F10(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F6AAF50D4FC216CEACF07CBC5E8A597B;// 0x2F58(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_ACC05C8747C2BE892C862193C35F4232;// 0x3080(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_8637EFAC42AB9C3FE0BA7590188D491E;// 0x30C8(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BFC03BA846153B029BBDB69EF0501595;// 0x31F0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_57AF7F1E4BF5FB2E11B255BF3B108661;// 0x3238(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E3C902824DB8F2F84012248AE54902B0;// 0x3360(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F25C3591488058B38BDA6F88133AF160;// 0x33A8(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B642424848F2A6CA9BB212A0C99D8E76;// 0x34D0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_55570AC7477582B40A823CB1A522E372;// 0x3518(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_13F283FD40AC7387F7EB7FAB5F836531;// 0x3588(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2568BB394307ABB8029AC28A5DDBE02C;// 0x35D0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_30018FA54E2F474356064AAAE2732046;// 0x3640(0x0048)
	unsigned char                                      UnknownData00[0x8];                                       // 0x3688(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_87BE91984D070317840ABF9D24223EA4;// 0x3690(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4829BB7B4B8CBBC3B5A355B774E932E3;// 0x3710(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_743728174018A2170276AEAFA7817554;// 0x3780(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_07631598422BAF18E4A0799D2A9C37B1;// 0x37C8(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_94B8F5274F4009BFC7CC1FB12A7F37B4;// 0x38F0(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C5A8E5CC459C1623FA41A5A01CF136FC;// 0x39C0(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_BFC9FF7F4AB1095D80C083B2937A4ABD;// 0x3AE8(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E7C3C24142484D22D7DF809678272782;// 0x3C10(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_55DEC1144BB0E2578C61FB9BCB6012A9;// 0x3CE0(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_3789D06E452AFA7F25DACFBDE0A9345B;// 0x3E08(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_E8C07D8B44F6C94D107D1B8E15006C99;// 0x3ED8(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_82DDFA8C4D414FE5686B37A3797FC965;// 0x4000(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_59CB37DB496B076D0E397C9B48F69C7A;// 0x40D0(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A01138884FED3432153858BA614ECFA6;// 0x4140(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_83D53E2F47AB1908584AF7B3840A1614;// 0x4210(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_AC33334C4F7E28A9638487A0E7ED166D;// 0x42E0(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_20250469455C386E98E70E9C109B177A;// 0x4408(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9A193B094DF703E887FBC7B69D3B5B11;// 0x4450(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_10CB8FD54FAE44A8B9C65CAFFC2BA774;// 0x44C0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_3167FB544BB7D27462CB66BE38A8FF4E;// 0x4508(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1DF1E31049DC24A1F72AF3BFC6E1C4C7;// 0x4630(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C8606FC142F5FAF1419982950F9B59EA;// 0x4678(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5002607C46A8A0D4B165C1B406AD97E7;// 0x47A0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_0D5691764DBF66CF6392EE810E54C308;// 0x47E8(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7C00ABE047891E81F44B248E0D18FD5C;// 0x4910(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_E00E400D447F6BB93801AD81FB9E1421;// 0x4958(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_0F6293B34D5BBF99C5E485858F7D3840;// 0x4A80(0x0128)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C64BB4C345690936E0A9A59F14F95AF5;// 0x4BA8(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_DC2047244676DBDB23BD2D8C5F121701;// 0x4C18(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_42B9CBD6462F2C0B58D746B57D1DA96F;// 0x4CE8(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8B4C5D02441CDD54B9E0DDBE42BBCFDA;// 0x4DB8(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_9CF04C244B734C2C1DD32D9A3458203E;// 0x4E00(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3BCAA61A4967795C238B3F9CEC06DA1A;// 0x4ED0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3603CA3E483A9E6CBCD2FEA107D8354E;// 0x4F40(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_FE62081D4631BD7BE398EEBB65880696;// 0x4FB0(0x0048)
	unsigned char                                      UnknownData01[0x8];                                       // 0x4FF8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_49D6AD634865BE62E0910696C1E37E43;// 0x5000(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_61447E044ABFE439AF0F30B51A7736EB;// 0x5080(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CED36CA745425E0138BEF7B7057AB1B7;// 0x5100(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1DB7CC854ADACE198333D69BF377CB88;// 0x5180(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9650A7394B6F19349979E88CBC85EACF;// 0x5200(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D0509B0F4B0CC196BA3A099D532A7F6F;// 0x5280(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9BE1CD5C4E71F8DB70BA04B80762B26A;// 0x5300(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F55A366344EF171ADD979581790424E5;// 0x5380(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AAEE13B74B20EB0812416EB0B62ADFE4;// 0x5400(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_11C605074FC9443075E603BF75E2C858;// 0x5480(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1806E65E432E739F535203990D2527DC;// 0x5500(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5E032FC24608C0EE00DF47AAE23C11CE;// 0x5580(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_695C882140BDB7E816CE718A36AA9CFD;// 0x5600(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CF6B8985430668C559F036A0CC2F4AFE;// 0x5680(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EA987C5A4299CF44A17E33ABB3201672;// 0x5700(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FBC49E6B47FB2EAFEE8ED7A956D878A1;// 0x5780(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D793986044C1196FA65F7A917D21FE67;// 0x5800(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C40772B548AF2281B2BEDC8834A8AF9D;// 0x5880(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3B661AC84ADC631656C75D893D6486A7;// 0x5900(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1D22E0044FC6F8881CBA93B635D97B08;// 0x5980(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DE6EF6FE42D730573D15B48B1F70A7EE;// 0x5A00(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_135F1A5946C6953D932AEC8016C586E9;// 0x5A80(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E3FEA2874884CAFE5D96BCB195355632;// 0x5B00(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_09FDC0A246A3C29AF68673B7910E3164;// 0x5B80(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0C787A774872E288DB2FC98E78FF77E9;// 0x5C00(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_24FE0AA94D70CB8BB62C78AF0EE1640D;// 0x5C80(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2F20248144A2BB66DC9C6896157956FA;// 0x5D00(0x0080)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4736D902443910B3BEF5B2AD0CABA8E62;// 0x5D80(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_797ED40C47F75BA19749BCAA31865BBF;// 0x5DC8(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F178F330499D850892DFA4AFEF904BA4;// 0x5EF0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_46D3626F44C92B6C5ADB98AB59B5A0CD;// 0x5F38(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_EFB0C2764A542ED07AB761AADCDF6725;// 0x6060(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F399B6E545589928E2FD9D8203264EDA;// 0x60A8(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B53826C94120D31458A6568DF98F8DF2;// 0x61D0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_A465372C495B559EC3E9AF9A301F7D38;// 0x6218(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_EA21BCC143F2F4816EA78899951D0DCA;// 0x6340(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CCABA3E542FBE8B5930F45B2AE73DED2;// 0x6388(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0D70FE444E68DA3CF7F0BF823B302DE8;// 0x63F8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_095EFF3E437EA68AA6336D9F491371C2;// 0x64C8(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A73F2048414B11989AFDFA9D145D73C8;// 0x6538(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_786C28DF473CCD952F4472B35FEDA2EE;// 0x6608(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1EDDEF8C47E58A75CFC67FA81919F85E;// 0x6678(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_DBF8AC054F4D9D4BD152739DD84C6F66;// 0x66E8(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_45367E66434CB291D428C88816AC1BCF;// 0x67B8(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_77D0F36A4E30A2A22D1EDCB8BD9B8A34;// 0x6888(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C3A3FA8640E20179B9C296A709FB2150;// 0x6958(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0725D4B34925D3A36BB727ADBFD81726;// 0x69C8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B292CC9F4A360CFAA0A977A0DFD9E4D5;// 0x6A38(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EC1F7F71497978EE20AFC28056EEA8CD;// 0x6A80(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DB4D38274380617BDAEB7CA91CD75BAB;// 0x6AF0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_62DDDD5B4326CD5B9D6D0DBF79E2FC0C;// 0x6B60(0x0070)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_738B91D448E3A69859D345A340DA6135;// 0x6BD0(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4646BE0648B32EA1B104BCA17DDB4A63;// 0x6CA0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F575EC794261589DE08704B4E607158E;// 0x6CE8(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_792450E94ED90D4CA3E6F6880ABA5423;// 0x6E10(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F40EDAF8489E5D2734AC868DBED0331B;// 0x6E58(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_153243574D9E7ACE77782DBBA04C68CF;// 0x6F80(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_F83EC2EB4532197C904ADCB97D62503E;// 0x6FC8(0x00D8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9C8E78B941D79C549019DCACF4858E9D;// 0x70A0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FA1C57454D1CA0C1AFDF5B9784A826C1;// 0x70E8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4215482942E9497416285BAC9AE72DBA;// 0x7158(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6DC8127045DB40934056E9B5E97CABE2;// 0x71A0(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E9DCB5A144FF4F474A99BEAEB5CB9E13;// 0x7270(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6B6EBC5645469B4AEFDCE6ACA55FFFAB;// 0x72E0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E5A1F0214BF7E492CCDBBC8A1EC39319;// 0x7350(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E2CF35B44F523F9D7D69B89D105630CF;// 0x7398(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BE133DA541212E5D7342F49E51B816A1;// 0x7408(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6A8E817C4687277C51E278A43F3E61EF2;// 0x7450(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2A9405EC4A5508808C207F8EC9C9672E2;// 0x74C0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6A8E817C4687277C51E278A43F3E61EF;// 0x7508(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2A9405EC4A5508808C207F8EC9C9672E;// 0x7578(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E50F2EF24AB23B817682A0ABBE2BCF2C;// 0x75C0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_85F86FE24BCA41336607638DD307E905;// 0x7630(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8E2A48F347940252AB24B4BD89D1E12B;// 0x76A0(0x0070)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_FE4519EC473FEBAD15E56295A4E99FAE;// 0x7710(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6403D64E44EFC50E30B3BABEB522B039;// 0x77E0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_870E82B14FCF076C9D97D788E1AA20EA;// 0x7850(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0EDFA7B24E45CB1EE056159D94DF26B5;// 0x78C0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9581071F4AC45D32ED8A2B8A5CF2DA9E;// 0x7930(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D74BF86042F1EDA4279F5D9C188891E5;// 0x7978(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E64863B148D125DE610CC9BF20903506;// 0x79E8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_28DFB93A497200D26B65EDACABEC6247;// 0x7A30(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A2770EE643889A17C7D0C19378C156B9;// 0x7AA0(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0DA0E11D4447DE35445817B377FC0A74;// 0x7AE8(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_DCD2A973401D4CAC8C0F8DAA7122FAFF;// 0x7BB8(0x0128)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_760E72D0475198830E854BBD757668D3;// 0x7CE0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_11D14A5D438C6DA0320E4DB354BBD9C3;// 0x7D60(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_62AB3B28462303403E4D8FAB12A68E67;// 0x7DE0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F2EB39DF4BACE291CE8C7E832D9A6657;// 0x7E60(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5A7CAF0F44E316747C0B32BCC4204607;// 0x7EE0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AF2712EB467A365B574EEAA92D6A69F6;// 0x7F60(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0FD9B05148C5657F0033D2AA050AAA8C;// 0x7FE0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BF9C6AB9475FCB525D19A08E6F6F1E71;// 0x8060(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_93CE860D45D8E2C55EF954BEC3EA4B5C;// 0x80E0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A301FAE840F244A4F8D7D5808AF474A6;// 0x8160(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B29D6B8446FB5FFBD7E44C806B109EC8;// 0x81E0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_67FD6F8048F571ABC5F1009AC6B21572;// 0x8260(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_00F0962547FBCD41026AD0B78242F521;// 0x82E0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3BD5B9F84D676D579F3474A4EC894C3F;// 0x8360(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D3919B9D40F3CB900EC7A4B4AF0FB125;// 0x83E0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FFD8BA1F4B06C6374DAD4AB3B9E98439;// 0x8460(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_ED4A697C41AE122E7E8153B943CAAA35;// 0x84E0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DA69EBB44C2FA70B5FB6CAB7F3B4646D;// 0x8560(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0F302AF9400785D3A869F7BEB9A97A77;// 0x85E0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B76444CF4B07A002FED429864DF8A7EA;// 0x8660(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FD0B1723443CB55DAC4B7583D90F74FA;// 0x86E0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_579078AA42B783D774795685D05B38AA;// 0x8760(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A3DA91A04159B8CB5F4C0D9AC5A094FC;// 0x87E0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FE54BF4342CF197F8276609932B8ABD9;// 0x8860(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_33A65CE243061FFF9E72CEA2FE347A03;// 0x88E0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3CD96815469A5E3B7BA6AC980786689A;// 0x8960(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B00990EC45A31FD4D4119A807FE7F712;// 0x89E0(0x0080)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4CAC5ABE43F979A147C22694DB2E6B94;// 0x8A60(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_808E94AD4AF842943236BEAEDA31C2A4;// 0x8AA8(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_59C1A86F4807156935B14EB1477EACC4;// 0x8BD0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_CFF9246B4010D08913BC169F3E74FEC8;// 0x8C18(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_338CE96D471BA5B71133D2A82D59922B;// 0x8D40(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_8B26FFEB4BC89B84488B7AA26E9E8504;// 0x8D88(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_110EFD9D42EC3A19D3007ABF82B8F156;// 0x8EB0(0x0128)
	struct FAnimNode_MultiWayBlend                     AnimGraphNode_MultiWayBlend_F25F44EC446F74D48A0E0291B68C9B21;// 0x8FD8(0x0070)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_360E9C5D4A7008EA2E477CAFBC43972D;// 0x9048(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C59B520444FCEA4CB259DF81EB0839FD;// 0x9170(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B9374E3B48C9685260F2868026CAF861;// 0x91B8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_501BA42F4C30AB3E4FF87D8D6BC332F5;// 0x9228(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6A25246542CED47B1272B888675A5607;// 0x9270(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A7A4C55D4069CC0D8200F8A44F82F065;// 0x92E0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2A713E4444F88F3E93A4EF851C331DC1;// 0x9328(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_555B44384F21C3EA2353ECBB29E2AFE7;// 0x9450(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_A6E282D849F5DD405CA428AC3BC369EE;// 0x9498(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_716AEF6144C6DF50ACFF0DA47D184FB2;// 0x95C0(0x0128)
	struct FAnimNode_MultiWayBlend                     AnimGraphNode_MultiWayBlend_2700A7AF4DEE89CB59BCE59CA5FBD2B3;// 0x96E8(0x0070)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_053946F54FC4DFA4CA2C619F025269E4;// 0x9758(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_3F4099504FDEA686A1081286B2302AA3;// 0x9880(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_35F37044401DC8CBF6A30A9BB4B9FBF1;// 0x99A8(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_E306CCB646F6B48672B0868BBD51D68A;// 0x99F0(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_601BE27A4DB6DA336A001292326052E0;// 0x9B18(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_11E73C42479B9890E91166978B08F5F0;// 0x9B60(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_D92184C747CB44E74C4A64B98E8FFB50;// 0x9C88(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_32268FEB4B4C4A236FBA609DE782DC76;// 0x9DB0(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3B9456C149EFB97A50CCB8A75E01B1BE;// 0x9E80(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_12908C524B762A115EBA5BB2F8347AC3;// 0x9EC8(0x00D8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_4736D902443910B3BEF5B2AD0CABA8E6;// 0x9FA0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_9DCF792E4C810B9AB1ECE69CB72F5F75;// 0x9FE8(0x00D8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_29F0802B43D9241565441CB039162A67;// 0xA0C0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_21DA1FEE4F72E1BC97F26F8526468253;// 0xA108(0x00D8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_363817F54661F96AA6CAE09FE4269FAD;// 0xA1E0(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_77526EA74BFC9469654F28B856626E6B;// 0xA2C0(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_BE73C2FD4B6F812279448291C437CBCF;// 0xA3E8(0x00D0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_A6201432485A15401158A084D96CAEAD;// 0xA4B8(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D554E7374D0245464F29B680CFDEE92C;// 0xA560(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_57EC2545483E9245390D9397A3FA96EF;// 0xA5B0(0x0050)
	float                                              LeftRightBlendBuffer;                                     // 0xA600(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FidgetStrength;                                           // 0xA604(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              WantedFidgetStrength;                                     // 0xA608(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               ShouldBeInAir;                                            // 0xA60C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               shouldBypassIdle;                                         // 0xA60D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2];                                       // 0xA60E(0x0002) MISSED OFFSET
	float                                              AirZBlendBuffer;                                          // 0xA610(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               FromAxeSwing;                                             // 0xA614(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               ShouldBypassJumpThrust;                                   // 0xA615(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsInAimLoop;                                              // 0xA616(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               JumpLandHappenedInAimLoop;                                // 0xA617(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass JerichoABP.JerichoABP_C");
		return ptr;
	}


	void MakeLeftRightBinary(float InLeftRight, float* OutLeftRight);
	void SetShouldBypassIdle(bool shouldBypassIdle, bool* Out);
	void ShouldAxeInteruptGotoAir(bool* ShouldGotoAir);
	void Should180L_tr_idle(bool* should180L);
	void Should180R_tr_idle(bool* Should180R);
	void SetShouldBeInAir(bool ShouldBeInAir, bool* Out);
	void PrintFloat(float In, bool* Out);
	void IsVelocityZero(bool* ZeroVel);
	void ShouldGotoGroundFromLanding(bool* GotoGround);
	void IsGoingBackward(bool* GoingBackward);
	void should180L(bool* should180L);
	void Should180R(bool* Should180R);
	void ControlIsCenter(bool* GoingNowhere);
	void IsGoingForward(bool* GoingForward);
	void SetLeftRightBlendBuffer(float InTRR, bool* OutTrue);
